Repository: Meanveasna/MathPuzzle_OOPProject
Catalog: lib/l10n/app_*.arb
Languages: km

# appTitle
source: Math Puzzle
km: ល្បែងគណិតវិទ្យា

# mathPuzzlesTitle
source: MATH PUZZLES
km: ល្បែង គណិតវិទ្យា

source: START GAME
km: ចាប់ផ្តើមលេង

# enterUsername
source: Enter your username
km: បញ្ចូលឈ្មោះអ្នកប្រើ

# profile
source: My Profile
km: ប្រវត្តិរូប

source: SAVE CHANGES
km: រក្សាទុកការផ្លាស់ប្តូរ

source: Total Score
km: ពិន្ទុសរុប

source: Settings
km: ការកំណត់

source: Language
km: ភាសា

source: English
km: អង់គ្លេស

# khmer
source: Khmer (ខ្មែរ)
km: ខ្មែរ

source: Audio Settings
km: ការកំណត់សំឡេង

source: Music Volume
km: កម្រិតតន្ត្រី

source: Sound Volume
km: កម្រិតសំឡេង

source: Game Data
km: ទិន្នន័យហ្គេម

source: Reset Progress
km: កំណត់ឡើងវិញ

# resetProgressSubtitle
source: Clear all levels and scores
km: លុបកម្រិតនិងពិន្ទុទាំងអស់

source: Yes
km: បាទ/ចាស

source: No
km: ទេ

# chooseAvatar
source: Choose Your Avatar
km: ជ្រើសរើសតួអង្គរបស់អ្នក

# playQuick
source: Quick Calculation
km: គណិតរហ័ស

# playQuickDesc
source: Solve simple math problems quickly.
km: ដោះស្រាយលំហាត់គណិតងាយៗឱ្យបានរហ័ស

# playLogical
source: Logical Puzzle
km: ល្បែងតក្កវិទ្យា

# playLogicalDesc
source: Find the missing pattern.
km: ស្វែងរកលំនាំដែលបាត់

# playTrueFalse
source: True / False
km: ពិត / មិនពិត

# playTrueFalseDesc
source: Decide if the equation is correct.
km: សម្រេចចិត្តថាតើសមីការត្រឹមត្រូវឬអត់

# trainBrain
source: Train Your Brain, Improve Your Math Skill
km: បង្វឹកខួរក្បាលរបស់អ្នក បង្កើនជំនាញគណិតវិទ្យា

source: Scoreboard
km: តារាងពិន្ទុ

source: Exit
km: ចាកចេញ

source: Confirm Exit
km: បញ្ជាក់ការចាកចេញ

# confirmExitContent
source: Are you sure you want to exit the app?
km: តើអ្នកពិតជាចង់ចាកចេញមែនទេ?

source: Select Level
km: ជ្រើសរើសកម្រិត

# levelLocked
source: Level {level} is locked! Complete previous levels first.
km: កម្រិត {level} ត្រូវបានជាប់សោ! សូមបញ្ចប់កម្រិតមុនៗសិន។

# levelLabel
source: Level {level}
km: កម្រិត {level}

source: NEXT LEVEL
km: កម្រិតបន្ទាប់

source: RETRY
km: ព្យាយាមម្តងទៀត

source: Back to Menu
km: ត្រឡប់ទៅម៉ឺនុយ

source: Congratulations!
km: អបអរសាទរ!

# correctAnswer
source: Correct! 🎉
km: ត្រឹមត្រូវ! 🎉

# wrongAnswer
source: Wrong answer! Try again.
km: ចម្លើយខុស! ព្យាយាមម្តងទៀត។

source: Submit
km: ដាក់បញ្ចូន

# finalScore
source: Final Score: {score}
km: ពិន្ទុចុងក្រោយ: {score}

source: Replay
km: លេងម្តងទៀត

source: Menu
km: ម៉ឺនុយ

source: Level Passed!
km: ឆ្លងកាត់កម្រិត!

source: Level Failed
km: បរាជ័យកម្រិត

# correctCountLabel
source: Correct: {count} / {total}
km: ត្រឹមត្រូវ: {count} / {total}

# trueButton
source: TRUE
km: ពិត

# falseButton
source: FALSE
km: មិនពិត

source: Calculator
km: គណិតរហ័ស

source: Clear
km: សម្អាត

source: Enter answer
km: បញ្ចូលចម្លើយ

source: Coin
km: កាក់

# percentOf
source: {p}% of {base} = {shown}
km: {p}% នៃ {base} = {shown}

# algebraProblem
source: If {a}x + {b} = {result} then x = {shownX}
km: បើ {a}x + {b} = {result} នោះ x = {shownX}

# rectangleAreaProblem
source: Rectangle L = {l}, W = {w} Area = {shown}
km: ចតុកោណកែង បណ្តោយ = {l}, ទទឹង = {w} ផ្ទៃក្រឡា = {shown}

# circleAreaProblem
source: Circle r = {r} Area ≈ {shown}
km: រង្វង់ កាំ(r) = {r} ផ្ទៃក្រឡា ≈ {shown}

# formulaAreaCircle
source: Area of circle = π × r²
km: ផ្ទៃរង្វង់ = π × r²

# formulaAreaRect
source: Area of rectangle = L + W
km: ផ្ទៃចតុកោណកែង = បណ្តោយ + ទទឹង

# formulaPerimeterRect
source: Perimeter of rectangle = 2(L + W)
km: បរិមាត្រចតុកោណកែង = 2(បណ្តោយ + ទទឹង)

# formulaAreaTriangle
source: Triangle area = base × height
km: ផ្ទៃត្រីកោណ = បាត × កម្ពស់

source: Profile Saved!
km: បានរក្សាទុកប្រវត្តិរូប!

source: Edit Username
km: កែឈ្មោះអ្នកប្រើ

source: Enter new name
km: បញ្ចូលឈ្មោះថ្មី

source: Cancel
km: បោះបង់

source: Save
km: រក្សាទុក
